// 接雨水问题（单调栈）
// didi.com, http://fast.didi.com/foo/bar didi.com, fast.didi.com（// 字符串查找算法，以及需要校验下域名是否正常，以及需要返回索引位置）
// 介绍下平台，从业务架构与技术架构（周末把它写出来！！！！）
// 为什么需要设计一个数据组件发起请求（关联查询字段与表格数据，快速绑定到state，用于画布平台公共发起请求使用）
// 浏览器为什么要设计成同源；不同源的危害举个例子；header配置成*后如何避免csrf攻击（token存在localStorage中）
// localStorage怎么遍历出当前用户存储的所有localStorage，怎么避免多个人写入一个localStorage
// 如何监控白屏的问题（使用埋点监控平台错误日志继续问没有明显错误时该怎么办），用户测白屏了没有明显异常时怎么办；(代理接口、缓存是否异常、弱网环境等)如何分析出白屏出现的性能原因，如何优化这些性能原因
// ts的any与unkonw的区别，什么时候使用any，什么时候使用unknow（其他的ts的点也看一下）
// 泛型与断言的作用，什么时候使用
// 对于低代码内抛出的全局上下问，如何实现js沙箱，保护上下文不被篡改
// 对于低代码内的function字符串转化为可执行的function的有几种方法（在此使用的new Function，反问为什么是new Function），各有什么优缺点，如何排查错误（解析器的作用，讲解，写出来！！！！）
// chatGpt的前端应用场景，额外想学的技术
// 继续去深入思考一些其他连环发问的问题.....
// 求最长不重复字串，如​​1231456 => 231456​​